lyric="[ti&#58;晴天]&#10;[ar&#58;周杰伦]&#10;[al&#58;叶惠美]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;00]晴天&#32;&#45;&#32;周杰伦&#32;&#40;Jay&#32;Chou&#41;&#10;[00&#58;07&#46;31]词：周杰伦&#10;[00&#58;14&#46;63]曲：周杰伦&#10;[00&#58;21&#46;94]编曲：周杰伦&#10;[00&#58;29&#46;26]故事的小黄花&#10;[00&#58;32&#46;71]从出生那年就飘着&#10;[00&#58;36&#46;24]童年的荡秋千&#10;[00&#58;39&#46;75]随记忆一直晃到现在&#10;[00&#58;42&#46;91]Re&#32;So&#32;So&#32;Si&#32;Do&#32;Si&#32;La&#32;&#10;[00&#58;45&#46;93]So&#32;La&#32;Si&#32;Si&#32;Si&#32;Si&#32;La&#32;Si&#32;La&#32;So&#32;&#10;[00&#58;49&#46;87]吹着前奏望着天空&#10;[00&#58;53&#46;20]我想起花瓣试着掉落&#10;[00&#58;56&#46;72]为你翘课的那一天&#10;[00&#58;58&#46;83]花落的那一天&#10;[01&#58;00&#46;60]教室的那一间&#10;[01&#58;02&#46;32]我怎么看不见&#10;[01&#58;04&#46;12]消失的下雨天&#10;[01&#58;05&#46;81]我好想再淋一遍&#10;[01&#58;09&#46;99]没想到失去的勇气我还留着&#10;[01&#58;16&#46;12]好想再问一遍&#10;[01&#58;17&#46;97]你会等待还是离开&#10;[01&#58;24&#46;91]刮风这天我试过握着你手&#10;[01&#58;30&#46;45]但偏偏雨渐渐大到我看你不见&#10;[01&#58;38&#46;88]还要多久我才能在你身边&#10;[01&#58;45&#46;44]等到放晴的那天也许我会比较好一点&#10;[01&#58;52&#46;87]从前从前有个人爱你很久&#10;[01&#58;58&#46;54]但偏偏风渐渐把距离吹得好远&#10;[02&#58;06&#46;94]好不容易又能再多爱一天&#10;[02&#58;13&#46;50]但故事的最后你好像还是说了拜拜&#10;[02&#58;34&#46;90]为你翘课的那一天&#10;[02&#58;36&#46;88]花落的那一天&#10;[02&#58;38&#46;66]教室的那一间&#10;[02&#58;40&#46;39]我怎么看不见&#10;[02&#58;42&#46;15]消失的下雨天&#10;[02&#58;43&#46;87]我好想再淋一遍&#10;[02&#58;48&#46;00]没想到失去的勇气我还留着&#10;[02&#58;54&#46;15]好想再问一遍&#10;[02&#58;56&#46;03]你会等待还是离开&#10;[03&#58;02&#46;92]刮风这天我试过握着你手&#10;[03&#58;08&#46;49]但偏偏雨渐渐大到我看你不见&#10;[03&#58;16&#46;94]还要多久我才能在你身边&#10;[03&#58;23&#46;43]等到放晴的那天也许我会比较好一点&#10;[03&#58;30&#46;87]从前从前有个人爱你很久&#10;[03&#58;37&#46;14]偏偏风渐渐把距离吹得好远&#10;[03&#58;44&#46;88]好不容易又能再多爱一天&#10;[03&#58;51&#46;42]但故事的最后你好像还是说了拜拜&#10;[03&#58;58&#46;49]刮风这天我试过握着你手&#10;[04&#58;01&#46;97]但偏偏雨渐渐大到我看你不见&#10;[04&#58;05&#46;65]还要多久我才能够在你身边&#10;[04&#58;09&#46;07]等到放晴那天也许我会比较好一点&#10;[04&#58;12&#46;92]从前从前有个人爱你很久&#10;[04&#58;15&#46;91]但偏偏雨渐渐把距离吹得好远&#10;[04&#58;19&#46;38]好不容易又能再多爱一天&#10;[04&#58;22&#46;86]但故事的最后你好像还是说了拜"



for i in range(lyric.count('[')):
    left = lyric.find('[')
    right = lyric.find(']')
    lyric = lyric[:left]+'\n'+lyric[right+1:]

lyric = lyric.replace('&#10;','')
lyric = lyric.replace('&#32;',' ')
lyric = lyric.replace('&#45;','')
lyric = lyric.replace('&#40;','')
lyric = lyric.replace('&#41;','')

print(lyric)