
#什么时候用到循环?
#出现重复性或规律性任务,使用循环解决重复劳动:
#固定循环次数使用for循环
#不明确循环次数使用while循环,并设定循环条件

#for循环常见用法
#遍历range()函数: for i in range(10) #循环10次
#遍历列表: for i in [1,2,3,4] #在列表中依次读取列表值
#遍历字典: for i in {1:2,2:3,3:4} #在字典中依次读取键
#       a={1:老虎,2:狮子,3:大象}
#       遍历字典中的值: for value in a.value()
#       遍历字典中的所有项: for item in a.items()
#举例:
a={1:'老虎',2:'狮子',3:'大象'}
for value in a.values():    #(遍历值)
    print(value)
#>>>
#老虎
#狮子
#大象

a={1:'老虎',2:'狮子',3:'大象'}
for item in a.items():  #遍历所有项
    print(item) 
#>>>
#(1, '老虎')
#(2, '狮子')
#(3, '大象')

a={1:'老虎',2:'狮子',3:'大象'}
for key in a:   #遍历键
    print(key) 
#>>>
#1
#2
#3
